/*
********************************************************************************
*
*
* Filename      : vdr_test.c
* Version       : V1.00
* Programmer(s) : miaoyahan
* Time          : 20140722
********************************************************************************
*/

/*
********************************************************************************
*                               INCLUDES
********************************************************************************
*/
#include "Vdr.h"
/*
********************************************************************************
*                             LOCAL DEFINES
********************************************************************************
*/


/*
********************************************************************************
*                         LOCAL DATA TYPES
********************************************************************************
*/



/*
********************************************************************************
*                          CONST VARIABLES
********************************************************************************
*/
const VDR_FUC_TEST Vdr_Fuc_Test[]=//检定
{
 Vdr_Test_Mode,
 Vdr_Test_Mile,
 Vdr_Test_Pulse,
 Vdr_Test_Rtc,
 Vdr_Test_Break,
};

/*
********************************************************************************
*                          LOCAL VARIABLES
********************************************************************************
*/


/*
********************************************************************************
*                          GLOBAL VARIABLES
********************************************************************************
*/


/*
********************************************************************************
*                           FUNCTIONS EXTERN
********************************************************************************
*/

/*
********************************************************************************
*                              FUNCTIONS
********************************************************************************
*/


/**
  * @brief  进入鉴定状态
  * @param  None
  * @retval None
  */
void Vdr_Test_Mode(void)
{
    LcdShowMsgEx("进入鉴定状态",100);  
    Public_PlayTTSVoiceAlarmStr("进入鉴定状态");
    Test_EnterE0();
}
/**
  * @brief  里程误差测量
  * @param  None
  * @retval None
  */
void Vdr_Test_Mile(void)
{
    Test_EnterE1();
}
/**
  * @brief  脉冲系数误差测量
  * @param  None
  * @retval None
  */
void Vdr_Test_Pulse(void)
{
    Test_EnterE2();
}
/**
  * @brief  实时时间测量
  * @param  None
  * @retval None
  */
void Vdr_Test_Rtc(void)
{
    Test_EnterE3();
}
/**
  * @brief  退出鉴定模式
  * @param  None
  * @retval None
  */
void Vdr_Test_Break(void)
{

    Test_EnterE4();
    
    LcdShowMsgEx("返回正常状态",100);  
    Public_PlayTTSVoiceAlarmStr("返回正常状态");    
}

/**
  * @brief  
  * @param  None
  * @retval None
  */
void Vdr_Test_Pro(u8 cmdnum,VDR_HEAD *pHead)
{
    Vdr_Fuc_Test[cmdnum]();//执行鉴定
    pHead->len = 0;
    pHead->cmd = Vdr_Cmd_Test[cmdnum];
}












