#ifndef __CAN_ERQI_H
#define __CAN_ERQI_H

#include "stm32f2xx.h"

#define CAN_ERQI_UPLOAD_BUFFER_SIZE	200
#define CAN_ERQI_CMD_BUFFER_SIZE	100

/**************************************************************************
//函数名：Can_ErQi_Init
//功能：CAN接入初始化
//输入：无
//输出：无
//返回值：无
//备注：无
***************************************************************************/
void Can_ErQi_Init(void);
/**************************************************************************
//函数名：Can_ErQi_Parse
//功能：CAN盒子协议解析
//输入：无
//输出：无
//返回值：无
//备注：无
***************************************************************************/
void Can_ErQi_Parse(u8 *pBuffer, u16 BufferLen);
/**************************************************************************
//函数名：Can_ErQi_TimeTask
//功能：CAN定时任务
//输入：无
//输出：无
//返回值：无
//备注：实现对CAN盒子校时，每次终端重启，第1次导航后对CAN盒子校时，调度时间1秒1次
***************************************************************************/
FunctionalState Can_ErQi_TimeTask(void);
/**************************************************************************
//函数名：Can_ErQi_SendCmd
//功能：发送命令到CAN盒子
//输入：Cmd:命令字；pBuffer:指向参数（即命令字后面跟的数据）首地址；BufferLen:参数长度 
//输出：无
//返回值：0:成功；1:失败；2:长度错误
//备注：无
***************************************************************************/
u8 Can_ErQi_SendCmd(u8 Cmd, u8 *pBuffer, u16 BufferLen);
#endif